
class text_keys:
    def __init__(self):
        self.prior_envir = ['银金彩', '彩虹时代', '黄金时代']
        self.envir = [[] for _ in range(5)]
        self.envir [0] = ['水梦梦天下第一可爱']
        self.envir [1] = ['蓝海', '三星佩佩', '粗星佩佩', '减益概念股', '战技点概念股', '欢愉契约', '战技点契约','追击概念股', '染血概念股', '人才储备', '战力提升', '战力飙升']
        self.envir [2] = ['击破概念股', '贝洛伯格概念股', '星间旅人概念股', '仙舟概念股', '量子同频契约', '公司契约', '持续伤害契约', '星核猎手契约', '进化算法']
        self.envir [3] = ['夜之半神邀请', '追击邀请', '击破邀请', '群攻邀请', '能量邀请', '燃血邀请', '减益邀请', '持续伤害邀请', '量子同频邀请', '战技点邀请', '欢愉邀请', '列车同行邀请', '银河学者邀请', '贝洛伯格邀请', '星间旅人邀请', '仙舟邀请', '狼狩邀请', '盛会之星邀请', '昼之半神邀请', '群攻概念股', '狼狩概念股', '昼之半神概念股', '夜之半神概念股', '能量概念股', '列车同行概念股', '银河学者概念股', '敌后破坏', '策略大师', '特邀专家：停云', '特邀专家：加拉赫', '特邀专家：银狼', '成功经验', '红钻贵族', '蓝钻贵族', '尾彩', '特权阶级', '深井角斗场', '经济过热', '二手市场', '轮岗', '战争边疆', '劳务派遣合同', '经济严重过热', '长线利好', '命运礼物', '增发货币']
        self.envir [4] = ['白银时代', '人身意外险', '过剩经费', '英雄登场']
